#================== Задача 1 =======================

#	Найти сумму чисел списка стоящих на нечетной позиции

# list = [1, 2, 3, 4, 5, 6, 7, 8, 9]
# sum = 0
# i = 0
# while i < len(list):
#     sum = sum + int(list[i])
#     i = i+2
# print(sum)

#================== Задача 2 =======================

# 	Найти произведение пар чисел в списке. Парой считаем первый и 
# последний элемент, второй и предпоследний и т.д. 
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15] 

# import math
# list = [2, 3, 4, 5, 6]
# for i in range(math.ceil(len(list)/2)):
#     res = list[i] * list[len(list)-i-1]
#     print(res)

#================== Задача 3 =======================

# 	В заданном списке вещественных чисел найдите разницу между 
# максимальным и минимальным значением дробной части элементов. 
# Пример: [1.1, 1.2, 3.1, 5, 10.01] => 0.19
# Примечание: полагаю, в условии нет ошибки, а целое число добавлено, что бы 
# усложнить задачу. Тогда, судя по примеру, его надо игнорировать.

# list = [1.1, 1.2, 3.1, 5, 10.01]

# def find_max(list):
#     max = 0
#     rng = len(list)
#     for i in range(rng):
#         if (list[i]*10)%10 != 0: # выкидываем целое число
#             if max < (list[i]*10)%10:
#                 max = round((list[i]*10)%10, 2)
#     return round(max/10, 2)

# def find_min(list):
#     min = (list[0]*10)%10
#     rng = len(list)
#     for i in range(rng):
#         if (list[i]*10)%10 != 0: # выкидываем целое число
#             if min > (list[i]*10)%10:
#                 min = round((list[i]*10)%10, 2)
#     return round(min/10, 2)

# print(f'Максимум = {find_max(list)} минимум = {find_min(list)}; \
# разница: {find_max(list) - find_min(list)}')

#================== Задача 4 =======================

# Написать программу преобразования десятичного числа в двоичное

n = int(input('Введите число: '))
res = str('')
while n >= 1:
    if n%2 == 0:
        res = res + '0'
    else:
        res = res + '1'
    n = int(n/2)
print(res[::-1])